ХМНПФ_Общее/Documents/уп_РешениеОбОтказеНЧТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РешениеОбОтказеНЧТП</Name>
		</Properties>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_РешениеОбОтказеНЧТП/Forms/уф_ФормаДокумента/Ext/Form/Module.bsl
// ХМНПФ 07.06.2018 КлименкоМИ // Новая ХМ_ДоговорОПСПриИзмененииНаСервере() // №1682
&НаСервере
Процедура ХМ_ДоговорОПСПриИзмененииНаСервере()
	СуммаНаСчете = 0;
	//найти сумму на счете
	Если Не Объект.ДоговорОПС.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервыОПСОстатки.ДоговорОПС,
		|	РезервыОПСОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.уп_РезервыОПС.Остатки(&ДатаДок, ДоговорОПС = &ДоговорОПС) КАК РезервыОПСОстатки";
		
		Запрос.УстановитьПараметр("ДатаДок", КонецДня(Объект.Дата));
		Запрос.УстановитьПараметр("ДоговорОПС", Объект.ДоговорОПС);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
		    СуммаНаСчете = Выборка.СуммаОстаток;
		КонецЕсли;
	КонецЕсли;
	Элементы.ТекСумма.Заголовок = "Сумма на счете:     "+Формат(СуммаНаСчете,"ЧДЦ=2; ЧРГ=; ЧН=0") + " руб.";
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 07.06.2018 КлименкоМИ // ПриСозданииНаСервере() // №1682
	// ХМНПФ 07.06.2018 КлименкоМИ // Новая ХМ_ДоговорОПСПриИзмененииНаСервере() // №1682
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура ХМПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		//Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		//Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	#Удаление 
	ДоговорОПСПриИзмененииНаСервере();
	#КонецУдаления  
	#Вставка 
	// +ХМНПФ 07.06.2018 КлименкоМИ // ПриСозданииНаСервере() // №1682
	ХМ_ДоговорОПСПриИзмененииНаСервере();
	// -ХМНПФ 07.06.2018 КлименкоМИ // ПриСозданииНаСервере() // №1682	
	#КонецВставки
	мЭлемент=Элементы.ГруппаПечать;
	Для Каждого эл Из ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы Цикл
		Если эл.Имя="ФормаПечать" Тогда
			мЭлемент=эл;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры
